# Итоговая проверочная работа.

**Задача**: Написать программу, которая из имеющегося массива строк формирует массив из строк, длина которых меньше либо равна 3 символа. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

**Примеры**:

["hello", "2", "world", ":-)"] -> ["2", ":-)"]

["1234", "1567", "-2", "computer science"] -> ["-2"]

["Russia", "Denmark", "Kazan"] -> []

---
## Выполнение задания

1. Задаем исходный массив строк, который необходимо подвергнуть анализу ```(arrayStrings)```
2. Создаем метод для создания сортированного массива в соответсвии с условием (элементы массива содержат менее 4х символов)
    + указываем тип метода ```(string[])```
    + указываем тип аргументов метода ```(string[], int arraylenght)```
    + создаем переменную для подсчета элементов нового (отсортированного массива)
    (int counterDigits = 0)
    + циклом for перебираем каждый элемент массива сравнивая его длинну ```(stringtosort[i].Length < 4)``` и если условие выполняется то увеличиваем счетчик (counterDigits) на единицу ```(counterDigits++;)```
    + создаем новый массив длинной равной счетчику в предыдущем шаге  ```(counterDigits) ```
    ```(string[] sortedArray = new string[counterDigits])```
    + создаем переменную для перехода в новом(отсортированном) массиве
    (int digitCounterSortedArray = 0;)
    + перебираем массив при помощи цикла for и записываем в новый массив элементы, которые соответсвуют условию (длинна элемента <4) (если условие соблюдено увеличиваем ```digitCounterSortedArray``` на единицу для перехода к следующему элементу нового массива)
    + возвращаем новый массив.
3. Созданием метод печати массива в консоль.
    + указываем тип метода (void)
    + указываем тип аргумента метода ()
    + выводим массив при помощи цикла for на консоль.

4. 
    + Используя ранее созданный метод для печати массива (пункт3) выводим на консоль исходный массив.```(arrayStrings)```
    + добавляем разделители что бы отделить вывод исходного массива и отсортированного ``` Console.WriteLine(""); Console.WriteLine("Рeзультат сортировки");```
    + Используя ранее созданный метод для печати массива (пункт3) выводим на консоль отсортированный массив.(sortedArray)


## результаты работы программы

    [ "hello", "2", "world", ":-)", "6 5", " 11", "-2", "computer science", "Russia", "Denmark", "Kazan"]
    Рeзультат сортировки
    [ "2", ":-)", "6 5", " 11", "-2"]


